Revit 2017 API
ExportColorMode Enumeration
 An enumerated type listing export color mode.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public enum ExportColorMode
Visual Basic
Public Enumeration ExportColorMode
Visual C++
public enum class ExportColorMode
Members
Member name | Description
IndexColors |  All colors from the Revit project will be set to the closest of the 255 AutoCAD Color Index colors.
TrueColor |  All colors from the Revit project will be exported as 24-bit RGB values.
See Also
Autodesk.Revit.DB Namespace